using System.Collections.Generic;

namespace App.Data.DTO.HelperDTOs
{
    public class Item
    {
        public string Id { get; set; }
        public string Name { get; set; }
        public string Code { get; set; }
        public string Caption { get; set; }
        public string Info { get; set; }
        public List<Item> ChildItems { get; set; }
    }

    public class OperationListDTO
    {
        public List<Item> FirstLevels { get; set; }

        public OperationListDTO InitialiseObject()
        {
            return new OperationListDTO
            {
                FirstLevels = new List<Item>
                {
                    new Item // first level 
                    {
                        Id = "1",
                        Name = "ВИРОБНИЧІ ОПЕРАЦІЇ - ЛІКАРСЬКІ ФОРМИ",
                        Code = "1.",
                        ChildItems = new List<Item>
                        {
                            new Item // second level
                            {
                                Id = "1",
                                Name = "Стерильні продукти",
                                Code = "1.1.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Асептично виготовлені (виробничі операції для наступних лікарських форм)",
                                            Code = "1.1.1.",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Рідини в упаковках великого об’єму",
                                                    Code = "1.1.1.1.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "Ліофілізати",
                                                    Code = "1.1.1.2.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "М’які",
                                                    Code = "1.1.1.3.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "4",
                                                    Name = "Рідини в упаковках малого об’єму",
                                                    Code = "1.1.1.4.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "5",
                                                    Name = "Тверді та імплантанти",
                                                    Code = "1.1.1.5.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "6",
                                                    Name = "Інші (зазначити)",
                                                    Code = "1.1.1.6.",
                                                    Caption = "input",
                                                    Info = "У цій позиції може бути зазначено, наприклад, “Виробництво стерильної активної речовини”"
                                                }
                                            }
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Що піддаються кінцевій стерилізації (виробничі операції для наступних лікарських форм)",
                                            Code = "1.1.2.",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Рідини в упаковках великого об’єму",
                                                    Code = "1.1.2.1.",
                                                    Caption = "input",
                                                    Info = "У разі коли кінцева стерилізація продукту не здійснюється на місці виробником, а за контрактом іншим виробником, " +
                                                           "коментар “кінцева стерилізація гамма-опроміненням здійснюється іншим виробником” має бути зазначений щодо цієї " +
                                                           "лікарської форми в уточнюючих примітках"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "М’які",
                                                    Code = "1.1.2.2.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "Рідини в упаковках малого об’єму",
                                                    Code = "1.1.2.3.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "4",
                                                    Name = "Тверді та імплантанти",
                                                    Code = "1.1.2.4.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "5",
                                                    Name = "Інші продукти, що піддаються кінцевій стерилізації (зазначити)",
                                                    Code = "1.1.2.5.",
                                                    Caption = "input"
                                                }
                                            }
                                    },

                                    new Item // third level
                                    {
                                            Id = "3",
                                            Name = "Сертифікація серій стерильних продуктів",
                                            Code = "1.1.3.",
                                            Caption = "input",
                                            Info = "Застосовується до всіх стерильних лікарських форм, якщо відповідні обмеження не зазначені в уточнюючих примітках"
                                    }
                                }
                            },

                            new Item // second level
                            {
                                Id = "2",
                                Name = "Нестерильні продукти",
                                Code = "1.2.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Нестерильні продукти (виробничі операції для наступних лікарських форм)",
                                            Code = "1.2.1.",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Капсули тверді",
                                                    Code = "1.2.1.1.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "Капсули м’які",
                                                    Code = "1.2.1.2.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "Жувальні гуми",
                                                    Code = "1.2.1.3.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "4",
                                                    Name = "Імпрегновані матриці",
                                                    Code = "1.2.1.4.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "5",
                                                    Name = "Рідини для зовнішнього застосування",
                                                    Code = "1.2.1.5.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "6",
                                                    Name = "Рідини для внутрішнього застосування",
                                                    Code = "1.2.1.6.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "7",
                                                    Name = "Медичні гази",
                                                    Code = "1.2.1.7.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "8",
                                                    Name = "Інші тверді лікарські форми",
                                                    Code = "1.2.1.8.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "9",
                                                    Name = "Препарати під тиском",
                                                    Code = "1.2.1.9.",
                                                    Caption = "input",
                                                    Info = "Зазначаються препарати в спеціальних контейнерах під тиском газу. Якщо, наприклад," +
                                                           " рідкий аерозоль виготовлено шляхом механічного наповнення насосом, така дозована форма" +
                                                           " повинна бути визначена як “Рідина для зовнішнього застосування” або “Рідина для внутрішнього застосування”"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "10",
                                                    Name = "Генератори радіонуклідів",
                                                    Code = "1.2.1.10.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "11",
                                                    Name = "М’які",
                                                    Code = "1.2.1.11.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "12",
                                                    Name = "Супозиторії",
                                                    Code = "1.2.1.12.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "13",
                                                    Name = "Таблетки",
                                                    Code = "1.2.1.13.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "14",
                                                    Name = "Трансдермальні пластирі",
                                                    Code = "1.2.1.14.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "15",
                                                    Name = "Стоматологічні матеріали",
                                                    Code = "1.2.1.15.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "16",
                                                    Name = "Інші (зазначити)",
                                                    Code = "1.2.1.16.",
                                                    Caption = "input",
                                                    Info = "Приклади діяльності, які можуть бути зазначені у підрозділі 1.2.1.16. “Інші”:" +
                                                           "“Виробництво напівпродукту” (повинні бути визначені, наприклад, порошки для подальшої обробки);" +
                                                           "“Надкапсуляція” (ця діяльність зазвичай провадиться щодо досліджуваних лікарських засобів та їх " +
                                                           "контроль може відрізнятися від стандартного для капсул твердих"
                                                }
                                            }
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Сертифікація серій нестерильних продуктів",
                                            Code = "1.2.2.",
                                            Caption = "input",
                                            Info = "Застосовується до всіх нестерильних лікарських форм, якщо відповідні обмеження не зазначені в уточнюючих примітках"
                                    }
                                }
                            },

                            new Item // second level
                            {
                                Id = "3",
                                Name = "Біологічні лікарські засоби",
                                Code = "1.3.",
                                Info = "Біологічний лікарський засіб - лікарський засіб, активна речовина якого є біологічною субстанцією." +
                                       "Біологічна субстанція - речовина, яка виробляється або екстрагується з біологічного джерела і яка " +
                                       "потребує для її характеристики та визначення її якості комбінації фізико-хіміко-біологічних випробувань, " +
                                       "а також виробничого процесу та його контролю",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Біологічні лікарські засоби",
                                            Code = "1.3.1.",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Препарати крові",
                                                    Code = "1.3.1.1.",
                                                    Caption = "input",
                                                    Info = "Ця категорія вибирається, якщо є виробничі операції, що виконуються щодо " +
                                                           "біологічних продуктів, що містять активну речовину, виділену з крові. Зразки " +
                                                           "таких продуктів містять альбумін, фактор плазми VIII або імуноглобуліни, які отримані " +
                                                           "з крові. Обробку фактора VIII, який виробляється з використанням методу біотехнології," +
                                                           " не включають в цю категорію"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "Імунобіологічні лікарські засоби",
                                                    Code = "1.3.1.2.",
                                                    Caption = "input",
                                                    Info = "Ця категорія вибирається, якщо є виробничі операції, які здійснюються під час " +
                                                           "виробництва біопрепаратів, що мають імунологічний метод дії (наприклад, вакцини)"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "Лікарські засоби клітинної терапії",
                                                    Code = "1.3.1.3.",
                                                    Caption = "input",
                                                    Info = "Ця категорія вибирається, якщо є виробничі операції, які здійснюються під час виробництва продуктів клітинної терапії"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "4",
                                                    Name = "Лікарські засоби генної терапії",
                                                    Code = "1.3.1.4.",
                                                    Caption = "input",
                                                    Info = "Ця категорія вибирається, якщо є виробничі операції, які здійснюються під час виробництва продуктів генної терапії"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "5",
                                                    Name = "Біотехнологічні лікарські засоби",
                                                    Code = "1.3.1.5.",
                                                    Caption = "input",
                                                    Info = "Біотехнологія використовує генетично модифіковані клітини ссавців, або мікроорганізмів (наприклад, бактерій чи " +
                                                           "дріжджів), або біологічних субстанцій (наприклад, ферментів) під час виробництва біологічних продуктів. Ця " +
                                                           "категорія вибирається, якщо є виробничі операції, які здійснюються під час виробництва біологічних продуктів з " +
                                                           "використанням біотехнологій"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "6",
                                                    Name = "Препарати, екстраговані з тканин людини або тварин",
                                                    Code = "1.3.1.6.",
                                                    Caption = "input",
                                                    Info = "Ця категорія вибирається, якщо є виробничі операції, які здійснюються під час виробництва біологічного " +
                                                           "продукту, що містить активні речовини, отримані з тканин людини або тварин (клітини, тканини, рідини), крім крові"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "7",
                                                    Name = "Лікарські засоби тканинної інженерії",
                                                    Code = "1.3.1.7.",
                                                    Caption = "input",
                                                    Info = "Ця категорія вибирається, якщо є виробничі операції, які здійснюються під час виробництва лікарських засобів тканинної інженерії"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "8",
                                                    Name = "Інші (зазначити)",
                                                    Code = "1.3.1.8.",
                                                    Caption = "input",
                                                    Info = "Ця категорія вибирається, якщо є виробничі операції, які здійснюються під час виробництва біологічного продукту, " +
                                                           "що містить біологічно активну субстанцію, яка зазначена вище. Категорії повинні використовуватися, якщо" +
                                                           " виробнича дільниця виконує будь-які виробничі операції, пов’язані з виробництвом біологічних продуктів. Виробництво " +
                                                           "біологічної субстанції може бути частиною безперервного процесу під час виробництва готового біологічного продукту і" +
                                                           " ці операції також повинні бути зазначені в цьому розділі, де це доречно. Якщо ліцензовані операції також включають" +
                                                           " виготовлення готової лікарської форми для біологічного продукту, відповідна лікарська форма повинна також бути зазначена " +
                                                           "в ліцензії (наприклад, у підрозділі 1.1.1.2. “Ліофілізати”)"
                                                }
                                            }
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Сертифікація серій (перелік)",
                                            Code = "1.3.2.",
                                            Info = "Ця категорія вибирається у разі остаточної сертифікації уповноваженою особою готової лікарської форми " +
                                                   "біопрепарату. Записи також повинні бути зроблені відповідно до підрозділів 1.1.3 або 1.2.2, якщо потрібно " +
                                                   "зазначити тип лікарської форми",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Препарати крові",
                                                    Code = "1.3.2.1.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "Імунобіологічні лікарські засоби",
                                                    Code = "1.3.2.2.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "Лікарські засоби клітинної терапії",
                                                    Code = "1.3.2.3.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "4",
                                                    Name = "Лікарські засоби генної терапії",
                                                    Code = "1.3.2.4.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "5",
                                                    Name = "Біотехнологічні лікарські засоби",
                                                    Code = "1.3.2.5.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "6",
                                                    Name = "Препарати, екстраговані з тканин людини або тварин",
                                                    Code = "1.3.2.6.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "7",
                                                    Name = "Лікарські засоби тканинної інженерії",
                                                    Code = "1.3.2.7.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "8",
                                                    Name = "Інші (зазначити)",
                                                    Code = "1.3.2.8.",
                                                    Caption = "input"
                                                }
                                            }
                                    }
                                }
                            },

                            new Item // second level
                            {
                                Id = "4",
                                Name = "Інші продукти або виробнича діяльність",
                                Code = "1.4.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Виробництво",
                                            Code = "1.4.1.",
                                            Info = "У разі коли виробник здійснює виробничі операції, пов’язані з виробництвом рослинних " +
                                                   "або гомеопатичних лікарських форм (наприклад, таблеток), вони мають бути зазначені для" +
                                                   " відповідної лікарської форми (розділи 1.1 та 1.2) додатково до запису в підрозділі нижче." +
                                                   " Якщо виробник має ліцензію на виробничі операції тільки для рослинних або гомеопатичних " +
                                                   "лікарських форм, повинна бути уточнююча примітка “тільки рослинні продукти” або “тільки " +
                                                   "гомеопатичні продукти”, про це повинно бути зазначено у відповідній лікарській формі / " +
                                                   "виробничій операції у ліцензії",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Продукти з рослинної сировини",
                                                    Code = "1.4.1.1.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "Гомеопатичні препарати",
                                                    Code = "1.4.1.2.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "Інші (зазначити)",
                                                    Code = "1.4.1.3.",
                                                    Caption = "input"
                                                }
                                            }
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Стерилізація активних речовин/допоміжних речовин/готової продукції",
                                            Code = "1.4.2.",
                                            Info = "Зазначаєть у разі, коли діяльність із стерилізації не є частиною" +
                                                   " виробництва дозованої форми, наприклад, якщо виробник здійснює стерилізацію" +
                                                   " продукту методом гамма-випромінювання за контрактом від імені іншого виробника",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Фільтрація",
                                                    Code = "1.4.2.1.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "Сухожарова стерилізація",
                                                    Code = "1.4.2.2.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "Стерилізація паром",
                                                    Code = "1.4.2.3.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "4",
                                                    Name = "Хімічна стерилізація",
                                                    Code = "1.4.2.4.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "5",
                                                    Name = "Гамма-випромінювання",
                                                    Code = "1.4.2.5.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "6",
                                                    Name = "Електронно-променева стерилізація",
                                                    Code = "1.4.2.6.",
                                                    Caption = "input"
                                                }
                                            }
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Інші (зазначити)",
                                            Code = "1.4.3.",
                                            Caption = "input",
                                            Info = "“Зберігання” вноситься у разі, коли виробник здійснює лише сертифікацію серій " +
                                                   "та зберігання лікарських засобів. Приклади діяльності, яка може бути зазначена в підрозділі 1.4.3"
                                    }
                                }
                            },

                            new Item // second level
                            {
                                Id = "5",
                                Name = "Пакування",
                                Code = "1.5.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Первинне пакування/виробничі операції для наступних лікарських форм",
                                            Code = "1.5.1.",
                                            Info = "Первинне пакування стерильного продукту визначається як частина виробничих операцій, " +
                                                   "зазначених в розділі 1.1 стосовно стерильних лікарських засобів, якщо відсутні обмеження" +
                                                   " щодо конкретної лікарської форми",
                                            ChildItems = new List<Item>
                                            {
                                                new Item //fourth level
                                                {
                                                    Id = "1",
                                                    Name = "Капсули тверді",
                                                    Code = "1.5.1.1.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "2",
                                                    Name = "Капсули м’які",
                                                    Code = "1.5.1.2.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "3",
                                                    Name = "Жувальні гуми",
                                                    Code = "1.5.1.3.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "4",
                                                    Name = "Імпрегновані матриці",
                                                    Code = "1.5.1.4.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "5",
                                                    Name = "Рідини для зовнішнього застосування",
                                                    Code = "1.5.1.5.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "6",
                                                    Name = "Рідини для внутрішнього застосування",
                                                    Code = "1.5.1.6.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "7",
                                                    Name = "Медичні гази",
                                                    Code = "1.5.1.7.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "8",
                                                    Name = "Інші тверді лікарські форми",
                                                    Code = "1.5.1.8.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "9",
                                                    Name = "Препарати під тиском",
                                                    Code = "1.5.1.9.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "10",
                                                    Name = "Генератори радіонуклідів",
                                                    Code = "1.5.1.10.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "11",
                                                    Name = "М’які",
                                                    Code = "1.5.1.11.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "12",
                                                    Name = "Супозиторії",
                                                    Code = "1.5.1.12.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "13",
                                                    Name = "Tаблетки",
                                                    Code = "1.5.1.13.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "14",
                                                    Name = "Трансдермальні пластирі",
                                                    Code = "1.5.1.14.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "15",
                                                    Name = "Стоматологічні матеріали",
                                                    Code = "1.5.1.15.",
                                                    Caption = "input"
                                                },

                                                new Item //fourth level
                                                {
                                                    Id = "16",
                                                    Name = "Інші (зазначити)",
                                                    Code = "1.5.1.16.",
                                                    Caption = "input",
                                                    Info = "Приклади діяльності, яка може бути зазначена в підрозділі 1.5.1.16. " +
                                                           "“Інші нестерильні лікарські засоби”: якщо виробник здійснює первинне пакування, " +
                                                           "а не фактичне повне виробництво лікарської форми, яке згодом піддається кінцевій " +
                                                           "стерилізації, така лікарська форма має бути зазначена в підрозділі 1.5.1.16. “Інші" +
                                                           " нестерильні лікарські засоби” “Первинне пакування (назва дозованої форми), яка " +
                                                           "піддається кінцевій стерилізації”"
                                                }
                                            }
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Вторинне пакування",
                                            Code = "1.5.2.",
                                            Caption = "input",
                                            Info = "У разі коли ліцензовано вторинне пакування, це стосується усіх дозованих форм, " +
                                                   "якщо інше не зазначено в роз’яснюючих примітках"
                                    }
                                }
                            },

                            new Item // second level
                            {
                                Id = "6",
                                Name = "Проведення випробувань у рамках контролю якості",
                                Code = "1.6.",
                                Info = "Якщо виробник ліцензований для проведення контролю якості, відповідні категорії контролю повинні бути зазначені нижче",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Мікробіологічні: стерильність",
                                            Code = "1.6.1.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Мікробіологічні: мікробіологічна чистота",
                                            Code = "1.6.2.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "3",
                                            Name = "Фізичні/хімічні",
                                            Code = "1.6.3.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "4",
                                            Name = "Біологічні",
                                            Code = "1.6.4.",
                                            Caption = "input"
                                    }
                                }
                            }
                        }
                    },

                    new Item // first level
                    {
                        Id = "2",
                        Name = "ВИРОБНИЧІ ОПЕРАЦІЇ - АКТИВНІ ФАРМАЦЕВТИЧНІ ІНГРЕДІЄНТИ",
                        Code = "2.",
                        ChildItems = new List<Item>
                        {
                            new Item //second level
                            {
                                Id = "1",
                                Name = "Виробництво активної речовини шляхом хімічного синтезу",
                                Code = "2.1.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Виробництво активних проміжних речовин",
                                            Code = "2.1.1.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Виробництво неочищеного активного фармацевтичного інгредієнта",
                                            Code = "2.1.2.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "3",
                                            Name = "Солеутворення/очищення (зазначити) (наприклад, кристалізація)",
                                            Code = "2.1.3.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "4",
                                            Name = "Інші (зазначити)",
                                            Code = "2.1.4.",
                                            Caption = "input"
                                    }
                                }
                            },
                            new Item //second level
                            {
                                Id = "2",
                                Name = "Отримання активного фармацевтичного інгредієнта з природних джерел",
                                Code = "2.2.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Отримання речовини з рослин",
                                            Code = "2.2.1.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Отримання речовини з тварин",
                                            Code = "2.2.2.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "3",
                                            Name = "Отримання речовини з людського джерела",
                                            Code = "2.2.3.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "4",
                                            Name = "Отримання речовини з мінерального джерела",
                                            Code = "2.2.4.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "5",
                                            Name = "Модифікація отриманої речовини (зазначити джерело)",
                                            Code = "2.2.5.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "6",
                                            Name = "Очищення отриманої речовини (зазначити джерело)",
                                            Code = "2.2.6.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "7",
                                            Name = "Інше (зазначити)",
                                            Code = "2.2.7.",
                                            Caption = "input"
                                    }
                                }
                            },

                            new Item //second level
                            {
                                Id = "3",
                                Name = "Виробництво активного фармацевтичного інгредієнта з використанням біологічних процесів",
                                Code = "2.3.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Ферментація",
                                            Code = "2.3.1.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Культура клітин (зазначити тип клітин) (наприклад, ссавців/бактеріальні)",
                                            Code = "2.3.2.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "3",
                                            Name = "Виділення/очищення",
                                            Code = "2.3.3.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "4",
                                            Name = "Модифікація",
                                            Code = "2.3.4.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "5",
                                            Name = "Інше (зазначити)",
                                            Code = "2.3.5.",
                                            Caption = "input"
                                    }
                                }
                            },

                            new Item //second level
                            {
                                Id = "4",
                                Name = "Виробництво стерильного активного фармацевтичного інгредієнта (розділи 2.1, 2.2 і 2.3 заповнюються у разі необхідності)",
                                Code = "2.4.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Асептично виготовлені",
                                            Code = "2.4.1.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Препарати, що піддаються кінцевій стерилізації",
                                            Code = "2.4.2.",
                                            Caption = "input"
                                    }
                                }
                            },

                            new Item //second level
                            {
                                Id = "5",
                                Name = "Ступені загальної обробки",
                                Code = "2.5.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Ступені фізичної обробки (зазначити) (наприклад, сушіння, подрібнення / мікронізація, просіювання)",
                                            Code = "2.5.1.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Первинне пакування (закупорювання/герметизація активного фармацевтичного інгредієнта пакувальним матеріалом, який перебуває в прямому контакті з речовиною)",
                                            Code = "2.5.2.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "3",
                                            Name = "Вторинне пакування (розміщення герметичної первинної упаковки всередині зовнішнього пакувального матеріалу або контейнера. Це також включає будь-яке маркування матеріалу для ідентифікації або простежуваності (нумерація серії) активного фармацевтичного інгредієнта)",
                                            Code = "2.5.3.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "4",
                                            Name = "Інше (зазначити) (для операцій, не зазначених вище)",
                                            Code = "2.5.4.",
                                            Caption = "input"
                                    }
                                }
                            },

                            new Item //second level
                            {
                                Id = "6",
                                Name = "Проведення випробувань у рамках контролю якості",
                                Code = "2.6.",
                                ChildItems = new List<Item>
                                {
                                    new Item // third level
                                    {
                                            Id = "1",
                                            Name = "Фізичні/хімічні випробування",
                                            Code = "2.6.1.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "2",
                                            Name = "Мікробіологічні випробування (крім випробування стерильності)",
                                            Code = "2.6.2.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "3",
                                            Name = "Мікробіологічні випробування (включаючи випробування стерильності)",
                                            Code = "2.6.3.",
                                            Caption = "input"
                                    },

                                    new Item // third level
                                    {
                                            Id = "4",
                                            Name = "Біологічні випробування",
                                            Code = "2.6.4.",
                                            Caption = "input"
                                    }
                                }
                            }
                        }
                    },

                    new Item // first level
                    {
                        Id = "3",
                        Name = "ЗБЕРІГАННЯ",
                        Code = "3.",
                        ChildItems = new List<Item>
                        {
                            new Item
                            {
                                Id = "1",
                                Name = "Зберігання готової продукції",
                                Code = "3.1.",
                                Caption = "input"
                            },

                            new Item
                            {
                                Id = "2",
                                Name = "Зберігання сировини",
                                Code = "3.2.",
                                Caption = "input"
                            },

                            new Item
                            {
                                Id = "3",
                                Name = "Зберігання матеріалів",
                                Code = "3.3.",
                                Caption = "input"
                            }
                        }
                    },

                    new Item // first level
                    {
                        Id = "4",
                        Name = "ВИРОБНИЦТВО ДОСЛІДЖУВАНИХ ЛІКАРСЬКИХ ЗАСОБІВ",
                        Code = "4.",
                        ChildItems = new List<Item>
                        {
                            new Item
                            {
                                Id = "1",
                                Name = "Виробництво лікарських засобів для I, II і III фази клінічних досліджень",
                                Code = "4.1.",
                                Caption = "input"
                            }
                        }
                    }
                }
            };
        }
    }
}
